// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Cancel";
"GOBACK_BUTTON"		= "Go Back";
"DIAGNOSE_BUTTON"	= "Diagnose";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Configuring your computer...";
"MESSAGE_PREP_CONNECTION"	= "Preparing for connection...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Unexpected Error";
"MESSAGE_FATAL_ERROR_TITLE"		= "Sorry, an unexpected error has occurred.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Error";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Sorry...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Sorry";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Warning";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Do you want to continue?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "You haven’t provided all of the requested information.";
"ERROR_MESSAGE_VALIDATION_0001" = "Please check the fields marked with red arrows and enter the information requested.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "The text you entered is too short.";
"ERROR_MESSAGE_VALIDATION_0002" = "Please check the highlighted field and correct the text entered.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "The information you entered is incorrect.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "The user name you entered is not valid.";
"ERROR_MESSAGE_VALIDATION_0004" = "Please check the highlighted field and enter a valid user name for your NetInfo network.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "The password you entered is incorrect.";
"ERROR_MESSAGE_VALIDATION_0005" = "Please check the highlighted field and enter the correct password.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "The name you entered cannot be used.";
"ERROR_MESSAGE_VALIDATION_0006" = "Please check the highlighted field and choose a different short name.";
"ERROR_MESSAGE_VALIDATION_0007" = "There is already a user with this short name. Please enter a different short name.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "IP address you entered is empty.";
"ERROR_MESSAGE_VALIDATION_0010" = "IP address you entered contains invalid characters.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "The address must contain 4 segments."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Please check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "The address must contain 4 segments."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Please check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Each address segment must contain between 1 and 3 characters."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Please check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "The address you entered is not allowed.";
"ERROR_MESSAGE_VALIDATION_0014" = "Please check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "The subnet mask you entered is not valid.";
"ERROR_MESSAGE_VALIDATION_0015" = "Please check the highlighted field and enter a valid subnet mask. If you don’t know this information, ask your network administrator.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "The name you entered already exists on your NetInfo network. You will not be able to log into NetInfo using this name.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "You cannot have the same value.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "The password you entered is invalid.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "The credit card number you entered cannot be used.";
"ERROR_MESSAGE_VALIDATION_0019" = "Please check the highlighted field and enter a valid credit card number.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Your account name cannot begin with a number.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "The email address you entered might be unusable.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "The IP address and the router address are not consistent with the subnet mask you entered. Please check the following fields and enter valid values:\n     IP Address\n     Subnet Mask\n     Router Address\nIf you don’t know this information, ask your network administrator.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "The name you entered cannot be used.";
"ERROR_MESSAGE_VALIDATION_0023" = "Please check the highlighted field and choose a different name.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "There are duplicates.";
"ERROR_MESSAGE_VALIDATION_0024" = "Please check the highlighted field and enter unique values.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Your modem cannot detect a dial tone.";
"MESSAGE_NO_DIAL_TONE"					= "Please make sure your modem is connected and then click OK. Or, click Cancel to go back and select the Ignore dial tone checkbox.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Quit";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "The passwords do not match.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Please check the fields marked with red arrows and enter the same password in both fields.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Please enter a location name.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "You are creating a new network location where configuration information is saved. You must enter a location name now.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Please enter a different location name.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "The location name you entered already exists. Please enter a different name.";


"MESSAGE_TASK_FORMAT" = "“%1$@ connection via %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Wireless";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Cable Modem";
"CONNECTION_Lan" = "Local Area Network";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP with Client ID";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "Static IP";

"MESSAGE_TITLE_CONFIGURE" = "Configuring...";
"MESSAGE_FAILED_CONFIGURE" = "Configuration failed.";
"MESSAGE_DONE_CONFIGURE" = "Finish configuration.";
"MESSAGE_CHECKING_CONNECTION" = "Checking your network connection...";
"MESSAGE_CONNECTED" = "Network connection is established.";
"MESSAGE_NOT_CONNECTED" = "Unable to establish a network connection.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Your computer could not connect to the Internet. Click OK to go back and change your network settings, and try again.";

"DEFAULT_LOCATION_NAME" = "Location (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";